# ************************************************************
# Sequel Pro SQL dump
# バージョン 4096
#
# http://www.sequelpro.com/
# http://code.google.com/p/sequel-pro/
#
# ホスト: 127.0.0.1 (MySQL 5.5.28)
# データベース: restaurant_menu
# 作成時刻: 2015-01-17 15:27:50 +0000
# ************************************************************


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


# テーブルのダンプ fbusers
# ------------------------------------------------------------

DROP TABLE IF EXISTS `fbusers`;

CREATE TABLE `fbusers` (
  `id` bigint(20) unsigned NOT NULL,
  `user_id` varchar(36) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `first_name` varchar(255) DEFAULT NULL,
  `last_name` varchar(255) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  `link` varchar(255) DEFAULT NULL,
  `hometown_id` bigint(20) unsigned DEFAULT NULL,
  `hometown_name` varchar(255) DEFAULT NULL,
  `gender` varchar(10) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `timezone` tinyint(3) unsigned DEFAULT NULL,
  `locale` varchar(10) DEFAULT NULL,
  `verified` tinyint(1) unsigned DEFAULT NULL,
  `updated_time` datetime DEFAULT NULL,
  `token` varchar(255) DEFAULT NULL,
  `token_expires` datetime DEFAULT NULL,
  `status` tinyint(3) unsigned NOT NULL DEFAULT '1',
  `created` datetime DEFAULT NULL,
  `modified` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;



# テーブルのダンプ menu_images
# ------------------------------------------------------------

DROP TABLE IF EXISTS `menu_images`;

CREATE TABLE `menu_images` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `menu_id` int(11) unsigned NOT NULL,
  `user_id` varchar(36) NOT NULL DEFAULT '',
  `image` varchar(255) NOT NULL DEFAULT '',
  `is_main` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `vote` int(11) unsigned NOT NULL DEFAULT '0' COMMENT 'The number of how many people think this is proper image for the menu.',
  `created` datetime DEFAULT NULL,
  `modified` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `menu_id` (`menu_id`),
  KEY `user_id` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;



# テーブルのダンプ menu_registrants
# ------------------------------------------------------------

DROP TABLE IF EXISTS `menu_registrants`;

CREATE TABLE `menu_registrants` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `menu_id` int(11) unsigned NOT NULL,
  `user_id` varchar(36) NOT NULL DEFAULT '',
  `created` datetime DEFAULT NULL,
  `modified` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `menu_id` (`menu_id`,`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;



# テーブルのダンプ menu_tags
# ------------------------------------------------------------

DROP TABLE IF EXISTS `menu_tags`;

CREATE TABLE `menu_tags` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL DEFAULT '',
  `accessories` varchar(255) DEFAULT NULL,
  `order` int(11) unsigned NOT NULL DEFAULT '999999999',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '1',
  `created` datetime DEFAULT NULL,
  `modified` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

LOCK TABLES `menu_tags` WRITE;
/*!40000 ALTER TABLE `menu_tags` DISABLE KEYS */;

INSERT INTO `menu_tags` (`id`, `name`, `accessories`, `order`, `status`, `created`, `modified`)
VALUES
	(1,'カレー','',1,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(2,'カレーライス','カレー,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(3,'スープカレー','カレー,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(4,'タイカレー','カレー,タイ料理,アジア・エスニック',2,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(5,'グリーンカレー','カレー,タイカレー',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(6,'イエローカレー','カレー,タイカレー',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(7,'レッドカレー','カレー,タイカレー',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(8,'インドカレー','カレー,インド料理,アジア・エスニック',3,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(9,'マトンカレー','カレー,インドカレー',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(10,'キーマカレー','カレー,インドカレー',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(11,'バターチキンカレー','カレー,インドカレー',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(12,'サグカレー','カレー,インドカレー',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(13,'ラーメン','麺類,日本食',5,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(14,'つけ麺','ラーメン,麺類,日本食',6,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(15,'油そば','ラーメン,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(16,'支那そば','ラーメン,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(17,'醤油ラーメン','ラーメン,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(18,'味噌ラーメン','ラーメン,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(19,'塩ラーメン','ラーメン,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(20,'豚骨ラーメン','ラーメン,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(21,'魚介ラーメン','ラーメン,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(22,'豚骨醤油ラーメン','ラーメン,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(23,'トマトラーメン','ラーメン,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(24,'担々麺','ラーメン,麺類,日本食',7,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(25,'ワンタン麺','ラーメン,麺類,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(26,'タンメン','ラーメン,麺類,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(27,'麻婆麺','ラーメン,麺類,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(28,'ワンタン','ラーメン,麺類,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(29,'刃削麺','ラーメン,麺類,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(30,'パスタ','麺類,イタリアン,洋食',4,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(31,'スパゲッティー','パスタ,麺類,イタリアン,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(32,'ナポリタン','パスタ,麺類,イタリアン,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(33,'ペペロンチーノ','パスタ,麺類,イタリアン,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(34,'ミートソースパスタ','パスタ,麺類,イタリアン,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(35,'ボロネーゼ','パスタ,麺類,イタリアン,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(36,'ペスカトーレ','パスタ,麺類,イタリアン,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(37,'アラビアータ','パスタ,麺類,イタリアン,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(38,'ボンゴレ・ロッソ','パスタ,麺類,イタリアン,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(39,'カルボナーラ','パスタ,麺類,イタリアン,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(40,'ジェノベーゼ','パスタ,麺類,イタリアン,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(41,'和風パスタ','パスタ,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(42,'うどん・そば','麺類,日本食',8,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(43,'うどん','うどん・そば,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(44,'讃岐うどん','うどん・そば,うどん,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(45,'煮込みうどん','うどん・そば,うどん,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(46,'カレーうどん','うどん・そば,うどん,麺類,日本食,カレー',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(47,'きしめん','うどん・そば,うどん,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(48,'そば','うどん・そば,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(49,'沖縄そば','うどん・そば,そば,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(50,'ちゃんぽん','うどん・そば,そば,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(51,'焼きそば','うどん・そば,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(52,'焼うどん','うどん・そば,うどん,麺類,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(53,'冷麺','麺類,韓国料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(54,'冷やし中華','麺類,日本料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(55,'定食','日本食',9,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(56,'肉料理','',10,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(57,'魚料理','',11,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(58,'寿司','魚料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(59,'焼肉','焼き料理,肉料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(60,'生姜焼き','定食,炒め物,肉料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(61,'野菜炒め','定食,炒め物,野菜料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(62,'焼き魚','定食,焼き料理,魚料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(63,'天ぷら','揚げ物,野菜料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(64,'とんかつ','定食,揚げ物,肉料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(65,'からあげ','定食,揚げ物,鶏肉料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(66,'焼き鳥','定食,焼き料理,鶏肉料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(67,'コロッケ','定食,揚げ物,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(68,'フライ魚','定食,揚げ物,魚料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(69,'エビフライ','定食,揚げ物,魚料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(70,'牡蠣フライ','定食,揚げ物,魚料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(71,'洋食','',13,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(72,'グリルチキン','定食,焼き物,鶏肉料理,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(73,'チキン南蛮','定食,揚げ物,鶏肉料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(74,'ステーキ','焼き物,肉料理,アメリカ料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(75,'ハンバーグ','焼き物,肉料理,アメリカ料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(76,'鉄板焼き','焼き物,肉料理,アメリカ料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(77,'天丼','天ぷら,丼もの,揚げ物,野菜料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(78,'カツ丼','とんかつ,丼もの,揚げ物,肉料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(79,'親子丼','丼もの,鶏肉料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(80,'牛丼','丼もの,肉料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(81,'海鮮丼','丼もの,魚料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(82,'鰻重','丼もの,魚料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(83,'麻婆丼','麻婆豆腐,丼もの,野菜料理,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(84,'高菜丼','丼もの,野菜料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(85,'ネギトロ丼','丼もの,魚料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(86,'いくら丼','丼もの,魚料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(87,'釜飯','丼もの,鶏肉料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(88,'すき焼き','肉料理,焼き物,鍋料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(89,'しゃぶしゃぶ','肉料理,鍋料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(90,'おでん','野菜料理,鍋料理,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(91,'お好み焼き','焼き料理,粉物,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(92,'もんじゃ焼き','焼き料理,粉物,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(93,'たこ焼き','焼き料理,粉物,日本食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(94,'郷土料理','日本食',12,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(95,'ゴーヤーチャンプルー','炒め物,野菜料理,日本食,沖縄料理,郷土料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(96,'フーチャンプルー','炒め物,野菜料理,日本食,沖縄料理,郷土料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(97,'ソーメンチャンプルー','炒め物,野菜料理,日本食,沖縄料理,郷土料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(98,'にんじんしりしり','炒め物,野菜料理,日本食,沖縄料理,郷土料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(99,'オムライス','焼き料理,米料理,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(100,'シチュー','スープ,煮物,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(101,'ビーフシチュー','シチュー,スープ,煮物,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(102,'クリームシチュー','シチュー,スープ,煮物,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(103,'ハヤシライス','スープ,煮物,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(104,'中華料理','',14,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(105,'チャーハン','炒め物,米料理,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(106,'餃子','焼き料理,粉物,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(107,'飲茶','蒸し料理,粉物,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(108,'麻婆豆腐','炒め物,野菜料理,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(109,'天津飯','炒め物,米料理,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(110,'中華飯','丼もの,炒め物,米料理,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(111,'回鍋肉','炒め物,肉料理,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(112,'酢豚','炒め物,肉料理,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(113,'エビチリ','炒め物,魚料理,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(114,'レバニラ','炒め物,肉料理,中華料理',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(115,'韓国料理','アジア・エスニック',16,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(116,'プルコギ','炒め物,肉料理,韓国料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(117,'カルビ','炒め物,肉料理,韓国料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(118,'チヂミ','炒め物,粉物,韓国料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(119,'ビビンバ','炒め物,米料理,韓国料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(120,'チャプチェ','炒め物,野菜料理,韓国料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(121,'スンドゥブ','鍋料理,韓国料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(122,'キムチチゲ','鍋料理,韓国料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(123,'サムゲタン','鍋料理,韓国料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(124,'ユッケジャン','鍋料理,韓国料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(125,'ピザ','粉物,イタリアン,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(126,'ハンバーガー','パン料理,アメリカ料理,肉料理,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(127,'サンドウィッチ','パン料理,アメリカ料理,肉料理,洋食',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(128,'タイ料理','アジア・エスニック',15,1,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(129,'トムヤムクン','スープ,タイ料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(130,'トムヤムラーメン','トムヤムクン,ラーメン,麺類,タイ料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(131,'ガパオ','炒め物,肉料理,タイ料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(132,'カオマンガイ','蒸し料理,肉料理,タイ料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00'),
	(133,'パッタイ','炒め物,麺類,タイ料理,アジア・エスニック',999999999,0,'2015-01-04 16:34:00','2015-01-04 16:34:00');

/*!40000 ALTER TABLE `menu_tags` ENABLE KEYS */;
UNLOCK TABLES;


# テーブルのダンプ menu_users
# ------------------------------------------------------------

DROP TABLE IF EXISTS `menu_users`;

CREATE TABLE `menu_users` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `menu_id` int(11) unsigned NOT NULL,
  `user_id` varchar(36) NOT NULL DEFAULT '',
  `created` datetime DEFAULT NULL,
  `modified` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `menu_id` (`menu_id`,`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

LOCK TABLES `menu_users` WRITE;
/*!40000 ALTER TABLE `menu_users` DISABLE KEYS */;

INSERT INTO `menu_users` (`id`, `menu_id`, `user_id`, `created`, `modified`)
VALUES
	(1,14,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(2,25,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(3,26,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(4,27,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(5,28,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(6,29,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(7,34,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(8,35,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(9,36,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(10,37,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(11,39,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(12,40,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(13,41,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(14,42,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(15,43,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(16,48,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(17,49,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(18,50,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(19,51,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(20,53,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(21,54,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(22,56,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(23,57,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(24,58,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(25,59,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(26,60,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(27,70,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(28,98,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(29,125,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(30,128,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(31,131,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(32,133,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(33,134,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(34,136,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(35,139,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(36,144,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(37,154,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(38,162,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(39,163,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(40,164,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(41,165,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(42,166,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(43,167,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(44,168,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(45,169,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(46,170,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(47,171,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(48,172,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(49,173,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(50,174,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(51,175,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(52,176,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(53,177,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(54,195,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(55,196,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(56,197,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(57,198,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(58,199,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(59,200,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(60,226,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(61,257,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(62,258,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(63,259,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(64,260,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(65,261,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(66,262,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(67,263,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(68,269,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(69,274,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(70,275,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(71,276,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(72,277,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(73,278,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(74,279,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(75,280,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(76,281,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(77,282,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(78,283,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(79,284,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(80,285,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(81,286,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(82,287,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(83,288,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(84,289,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(85,290,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(86,291,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(87,292,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(88,294,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(89,299,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(90,301,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(91,303,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(92,304,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(93,307,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(94,308,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(95,309,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(96,310,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(97,311,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(98,312,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(99,313,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(100,314,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(101,315,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(102,316,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(103,317,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(104,318,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(105,319,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(106,320,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(107,321,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(108,322,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(109,323,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(110,329,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(111,333,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(112,334,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(113,335,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(114,336,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(115,338,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(116,339,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(117,340,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(118,341,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(119,342,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(120,343,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(121,344,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(122,345,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(123,346,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(124,347,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(125,349,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(126,350,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(127,366,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(128,370,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(129,411,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(130,467,'54abe567-e898-4afe-815b-5a68cf13b2c9','2015-01-10 00:00:00','2015-01-10 00:00:00'),
	(131,14,'54b7b877-c5b8-4432-8e6e-025ecf13b2c9','2015-01-17 13:02:00','2015-01-17 13:02:00');

/*!40000 ALTER TABLE `menu_users` ENABLE KEYS */;
UNLOCK TABLES;


# テーブルのダンプ menus
# ------------------------------------------------------------

DROP TABLE IF EXISTS `menus`;

CREATE TABLE `menus` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL DEFAULT '',
  `restaurant_id` int(11) unsigned NOT NULL,
  `description` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `remarks` varchar(255) DEFAULT NULL,
  `combo` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `lunch` tinyint(1) unsigned NOT NULL DEFAULT '1',
  `dinner` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `price` int(11) unsigned DEFAULT NULL,
  `tags` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `point` int(11) unsigned NOT NULL DEFAULT '0',
  `created` datetime DEFAULT NULL,
  `modified` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `name` (`name`),
  FULLTEXT KEY `tags` (`tags`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;



# テーブルのダンプ restaurant_geos
# ------------------------------------------------------------

DROP TABLE IF EXISTS `restaurant_geos`;

CREATE TABLE `restaurant_geos` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT 'restaurant_idと同じ値',
  `geo` geometry NOT NULL,
  `created` datetime DEFAULT NULL,
  `modified` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  SPATIAL KEY `geo` (`geo`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;



# テーブルのダンプ restaurants
# ------------------------------------------------------------

DROP TABLE IF EXISTS `restaurants`;

CREATE TABLE `restaurants` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL DEFAULT '',
  `description` varchar(255) DEFAULT NULL,
  `order` int(11) unsigned NOT NULL,
  `created` datetime DEFAULT NULL,
  `modified` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `name` (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;



# テーブルのダンプ stations
# ------------------------------------------------------------

DROP TABLE IF EXISTS `stations`;

CREATE TABLE `stations` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL DEFAULT '',
  `line` varchar(255) NOT NULL DEFAULT '',
  `latitude` varchar(255) DEFAULT NULL,
  `longitude` varchar(255) DEFAULT NULL,
  `modified` datetime DEFAULT NULL,
  `created` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

LOCK TABLES `stations` WRITE;
/*!40000 ALTER TABLE `stations` DISABLE KEYS */;

INSERT INTO `stations` (`id`, `name`, `line`, `latitude`, `longitude`, `modified`, `created`)
VALUES
	(1,'恵比寿','JR山手線','35.647131142195576','139.70925629138947','2014-11-23 17:54:41','2014-11-23 17:54:41'),
	(2,'中目黒','東急東横線・日比谷線','35.644253990569474','139.69894587993622','2014-11-23 17:56:22','2014-11-23 17:56:22'),
	(3,'代官山','東急東横線','35.648168635091054','139.70325618982315','2014-11-23 17:56:41','2014-11-23 17:56:41'),
	(4,'池尻大橋','東急田園都市線','35.650670768405725','139.68452632427216','2014-11-23 17:56:59','2014-11-23 17:56:59');

/*!40000 ALTER TABLE `stations` ENABLE KEYS */;
UNLOCK TABLES;


# テーブルのダンプ twusers
# ------------------------------------------------------------

DROP TABLE IF EXISTS `twusers`;

CREATE TABLE `twusers` (
  `id` bigint(20) unsigned NOT NULL,
  `user_id` varchar(36) DEFAULT '',
  `screen_name` varchar(15) NOT NULL DEFAULT '',
  `name` varchar(20) NOT NULL DEFAULT '',
  `description` text,
  `profile_image_url` varchar(255) DEFAULT NULL,
  `profile_image_url_https` varchar(255) DEFAULT NULL,
  `profile_background_image_url` varchar(255) DEFAULT NULL,
  `profile_background_image_url_https` varchar(255) DEFAULT NULL,
  `profile_use_background_image` tinyint(1) DEFAULT NULL,
  `profile_text_color` varchar(6) DEFAULT NULL,
  `profile_link_color` varchar(6) DEFAULT NULL,
  `profile_background_color` varchar(6) DEFAULT NULL,
  `profile_sidebar_border_color` varchar(6) DEFAULT NULL,
  `profile_sidebar_fill_color` varchar(6) DEFAULT NULL,
  `url` varchar(255) DEFAULT NULL,
  `profile_banner_url` varchar(255) DEFAULT NULL,
  `protected` tinyint(1) unsigned DEFAULT NULL,
  `is_translator` tinyint(1) unsigned DEFAULT NULL,
  `verified` tinyint(1) unsigned DEFAULT NULL,
  `contributors_enabled` tinyint(1) unsigned DEFAULT NULL,
  `geo_enabled` tinyint(1) unsigned DEFAULT NULL,
  `follow_request_sent` tinyint(1) unsigned DEFAULT NULL,
  `profile_background_tile` tinyint(1) unsigned DEFAULT NULL,
  `location` varchar(255) DEFAULT NULL,
  `lang` varchar(5) DEFAULT NULL,
  `utc_offset` int(11) unsigned DEFAULT NULL,
  `time_zone` varchar(15) DEFAULT NULL,
  `followers_count` int(11) unsigned DEFAULT NULL,
  `friends_count` int(11) unsigned DEFAULT NULL,
  `listed_count` int(11) unsigned DEFAULT NULL,
  `favourites_count` int(11) unsigned DEFAULT NULL,
  `statuses_count` int(11) unsigned DEFAULT NULL,
  `default_profile` tinyint(1) unsigned DEFAULT NULL,
  `default_profile_image` tinyint(1) unsigned DEFAULT NULL,
  `notifications` tinyint(1) unsigned DEFAULT NULL,
  `following` tinyint(1) unsigned DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `token` varchar(255) DEFAULT NULL,
  `secret` varchar(255) DEFAULT NULL,
  `status` int(3) unsigned NOT NULL DEFAULT '1',
  `created` datetime DEFAULT NULL,
  `modified` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;



# テーブルのダンプ users
# ------------------------------------------------------------

DROP TABLE IF EXISTS `users`;

CREATE TABLE `users` (
  `id` varchar(36) NOT NULL DEFAULT '',
  `username` varchar(255) NOT NULL DEFAULT '',
  `password` varchar(50) NOT NULL DEFAULT '',
  `name` varchar(255) DEFAULT NULL,
  `nickname` varchar(255) DEFAULT NULL,
  `first_name` varchar(255) DEFAULT NULL,
  `last_name` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `description` text,
  `role` varchar(255) DEFAULT 'author',
  `status` tinyint(3) unsigned NOT NULL DEFAULT '1',
  `spam` tinyint(3) unsigned NOT NULL DEFAULT '0' COMMENT '0:normal,1:candidate,2:spam',
  `created` datetime DEFAULT NULL,
  `modified` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;

INSERT INTO `users` (`id`, `username`, `password`, `name`, `nickname`, `first_name`, `last_name`, `image`, `description`, `role`, `status`, `spam`, `created`, `modified`)
VALUES
	('54abe567-e898-4afe-815b-5a68cf13b2c9','coozo.office@gmail.com','47cd98feb883cd1e9cc2ac3fdd39022f050190df','euonymus',NULL,'','','http://coozo.co/apple-touch-icon-precomposed.png',NULL,'admin',1,0,'2015-01-06 22:38:47','2015-01-09 14:48:02');

/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;



/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
